tap "homebrew/bundle"
brew "graphviz"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "blackhole-16ch"
cask "evernote"
cask "iterm2"
cask "maccy"
cask "miniforge"
cask "rectangle"
cask "teamviewer"
cask "temurin"
vscode "aminer.codegeex"
vscode "bierner.markdown-mermaid"
vscode "cameronbieganek.julia-color-themes"
vscode "davidbwaters.macos-modern-theme"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "jebbs.plantuml"
vscode "mhutchie.git-graph"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.live-server"
vscode "sdras.night-owl"
vscode "tomoki1207.pdf"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
