tap "homebrew/bundle"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "gdk-pixbuf"
brew "git"
brew "gmsh"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "pandoc"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "blackhole-16ch"
cask "cheatsheet"
cask "deepl"
cask "evernote"
cask "iterm2"
cask "maccy"
cask "miktex-console"
cask "miniforge"
cask "rectangle"
cask "teamviewer"
cask "temurin"
cask "zoom"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "cameronbieganek.julia-color-themes"
vscode "danielsanmedium.dscodegpt"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "eamodio.gitlens"
vscode "executablebookproject.myst-highlight"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "mathworks.language-matlab"
vscode "mhutchie.git-graph"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "njpwerner.autodocstring"
vscode "sdras.night-owl"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
